data/raw_bench/1700_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.543ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.542ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.541ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.539ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   540.39us  186.24us   0.85ms   95.66%
    Req/Sec   447.25    217.32     1.00k    60.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  520.00us
 75.000%  591.00us
 90.000%  662.00us
 99.000%    0.85ms
 99.900%    1.88ms
 99.990%    9.16ms
 99.999%   10.33ms
100.000%   10.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.284     0.000000            1         1.00
       0.427     0.100000         3461         1.11
       0.455     0.200000         6868         1.25
       0.477     0.300000        10268         1.43
       0.498     0.400000        13671         1.67
       0.520     0.500000        16972         2.00
       0.532     0.550000        18664         2.22
       0.545     0.600000        20430         2.50
       0.559     0.650000        22128         2.86
       0.574     0.700000        23789         3.33
       0.591     0.750000        25482         4.00
       0.600     0.775000        26279         4.44
       0.610     0.800000        27125         5.00
       0.621     0.825000        27954         5.71
       0.633     0.850000        28818         6.67
       0.646     0.875000        29654         8.00
       0.654     0.887500        30095         8.89
       0.662     0.900000        30510        10.00
       0.671     0.912500        30923        11.43
       0.683     0.925000        31350        13.33
       0.696     0.937500        31769        16.00
       0.703     0.943750        31986        17.78
       0.711     0.950000        32185        20.00
       0.721     0.956250        32406        22.86
       0.731     0.962500        32618        26.67
       0.744     0.968750        32823        32.00
       0.752     0.971875        32925        35.56
       0.761     0.975000        33029        40.00
       0.773     0.978125        33141        45.71
       0.786     0.981250        33243        53.33
       0.802     0.984375        33351        64.00
       0.812     0.985938        33400        71.11
       0.826     0.987500        33457        80.00
       0.840     0.989062        33507        91.43
       0.861     0.990625        33558       106.67
       0.883     0.992188        33612       128.00
       0.899     0.992969        33638       142.22
       0.931     0.993750        33665       160.00
       0.955     0.994531        33690       182.86
       0.989     0.995313        33717       213.33
       1.044     0.996094        33745       256.00
       1.053     0.996484        33756       284.44
       1.079     0.996875        33770       320.00
       1.118     0.997266        33783       365.71
       1.150     0.997656        33796       426.67
       1.178     0.998047        33809       512.00
       1.228     0.998242        33816       568.89
       1.259     0.998437        33824       640.00
       1.306     0.998633        33829       731.43
       1.546     0.998828        33836       853.33
       1.983     0.999023        33842      1024.00
       2.471     0.999121        33846      1137.78
       2.815     0.999219        33849      1280.00
       3.039     0.999316        33852      1462.86
       3.413     0.999414        33856      1706.67
       4.767     0.999512        33859      2048.00
       4.875     0.999561        33861      2275.56
       4.911     0.999609        33862      2560.00
       5.243     0.999658        33864      2925.71
       5.687     0.999707        33866      3413.33
       6.275     0.999756        33867      4096.00
       6.387     0.999780        33868      4551.11
       7.311     0.999805        33869      5120.00
       7.863     0.999829        33870      5851.43
       8.687     0.999854        33871      6826.67
       8.687     0.999878        33871      8192.00
       9.159     0.999890        33872      9102.22
       9.159     0.999902        33872     10240.00
       9.287     0.999915        33873     11702.86
       9.287     0.999927        33873     13653.33
       9.287     0.999939        33873     16384.00
       9.575     0.999945        33874     18204.44
       9.575     0.999951        33874     20480.00
       9.575     0.999957        33874     23405.71
       9.575     0.999963        33874     27306.67
       9.575     0.999969        33874     32768.00
      10.327     0.999973        33875     36408.89
      10.327     1.000000        33875          inf
#[Mean    =        0.540, StdDeviation   =        0.186]
#[Max     =       10.320, Total count    =        33875]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  50768 requests in 30.00s, 9.63MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1692.25  
Transfer/sec:    328.86KB