data/raw_bench/1800_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.533ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.535ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.536ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.535ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   540.45us  265.55us 842.00us   98.63%
    Req/Sec   473.80    224.45     1.10k    65.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  517.00us
 75.000%  588.00us
 90.000%  662.00us
 99.000%  842.00us
 99.900%    4.23ms
 99.990%   10.34ms
 99.999%   17.60ms
100.000%   17.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.294     0.000000            1         1.00
       0.423     0.100000         3692         1.11
       0.451     0.200000         7312         1.25
       0.473     0.300000        10862         1.43
       0.494     0.400000        14376         1.67
       0.517     0.500000        18042         2.00
       0.529     0.550000        19824         2.22
       0.542     0.600000        21670         2.50
       0.556     0.650000        23450         2.86
       0.571     0.700000        25183         3.33
       0.588     0.750000        26917         4.00
       0.598     0.775000        27829         4.44
       0.608     0.800000        28724         5.00
       0.619     0.825000        29636         5.71
       0.631     0.850000        30518         6.67
       0.645     0.875000        31412         8.00
       0.653     0.887500        31886         8.89
       0.662     0.900000        32327        10.00
       0.671     0.912500        32749        11.43
       0.681     0.925000        33197        13.33
       0.693     0.937500        33656        16.00
       0.700     0.943750        33882        17.78
       0.708     0.950000        34092        20.00
       0.718     0.956250        34317        22.86
       0.730     0.962500        34551        26.67
       0.744     0.968750        34776        32.00
       0.751     0.971875        34886        35.56
       0.759     0.975000        34990        40.00
       0.769     0.978125        35103        45.71
       0.781     0.981250        35213        53.33
       0.796     0.984375        35330        64.00
       0.805     0.985938        35383        71.11
       0.817     0.987500        35442        80.00
       0.832     0.989062        35494        91.43
       0.849     0.990625        35549       106.67
       0.873     0.992188        35608       128.00
       0.886     0.992969        35632       142.22
       0.913     0.993750        35660       160.00
       0.948     0.994531        35688       182.86
       0.970     0.995313        35717       213.33
       1.018     0.996094        35744       256.00
       1.043     0.996484        35758       284.44
       1.077     0.996875        35772       320.00
       1.136     0.997266        35786       365.71
       1.196     0.997656        35800       426.67
       1.246     0.998047        35814       512.00
       1.285     0.998242        35822       568.89
       1.449     0.998437        35828       640.00
       1.866     0.998633        35835       731.43
       3.273     0.998828        35842       853.33
       4.315     0.999023        35849      1024.00
       4.603     0.999121        35853      1137.78
       4.707     0.999219        35856      1280.00
       5.023     0.999316        35860      1462.86
       5.591     0.999414        35863      1706.67
       6.791     0.999512        35867      2048.00
       7.191     0.999561        35869      2275.56
       7.311     0.999609        35870      2560.00
       7.599     0.999658        35872      2925.71
       8.559     0.999707        35874      3413.33
       9.095     0.999756        35876      4096.00
       9.375     0.999780        35877      4551.11
       9.375     0.999805        35877      5120.00
       9.439     0.999829        35878      5851.43
       9.927     0.999854        35879      6826.67
      10.343     0.999878        35880      8192.00
      13.159     0.999890        35881      9102.22
      13.159     0.999902        35881     10240.00
      13.159     0.999915        35881     11702.86
      13.591     0.999927        35882     13653.33
      13.591     0.999939        35882     16384.00
      14.247     0.999945        35883     18204.44
      14.247     0.999951        35883     20480.00
      14.247     0.999957        35883     23405.71
      14.247     0.999963        35883     27306.67
      14.247     0.999969        35883     32768.00
      17.599     0.999973        35884     36408.89
      17.599     1.000000        35884          inf
#[Mean    =        0.540, StdDeviation   =        0.266]
#[Max     =       17.584, Total count    =        35884]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  53790 requests in 30.00s, 10.21MB read
Requests/sec:   1792.74  
Transfer/sec:    348.39KB